#include "graph.h"
#include <clocale>

int main()
{
	setlocale(LC_CTYPE, "rus");
	graph obj;
	obj.input();
	obj.imaginary_edge_matrix();
	obj.find_comps();
	obj.unification_comp();
	 
	obj.finding_the_right_edges();
	obj.min_search();
	


	return 0;
}
/*
1. выделить компоненты связности 
2. применить к компонентам связности алгоритм прима
3. соединить компоненты связности 
*/


/*
0 0 1 1 0 0 0          
0 0 0 0 1 0 0
1 0 0 1 0 0 0
1 0 1 0 0 0 0
0 1 0 0 0 1 1
0 0 0 0 1 0 0
0 0 0 0 1 0 0

0 0 5 4 0 0 0
0 0 0 0 9 0 0
5 0 0 3 0 0 0
4 0 3 0 0 0 0
0 9 0 0 0 6 2
0 0 0 0 6 0 0
0 0 0 0 2 0 0

0 0 5 4 0 0 0
0 0 0 0 6 0 0
5 0 0 3 0 0 0
4 0 3 0 0 0 0
0 6 0 0 0 9 2
0 0 0 0 9 0 0
0 0 0 0 2 0 0

0 1 0 0 0 0 0 0
1 0 0 0 0 0 0 0
0 0 0 0 0 0 1 1
0 0 0 0 1 0 0 0
0 0 0 1 0 1 0 0
0 0 0 0 1 0 0 0
0 0 1 0 0 0 0 0
0 0 1 0 0 0 0 0

0 1 0 0 0 0 0 0 0 0 
1 0 1 0 0 0 0 0 0 0 
0 1 0 0 0 0 0 0 0 0 
0 0 0 0 1 0 0 0 0 0 
0 0 0 1 0 0 0 0 0 0 
0 0 0 0 0 0 1 0 0 0 
0 0 0 0 0 1 0 0 0 0 
0 0 0 0 0 0 0 0 1 0 
0 0 0 0 0 0 0 1 0 1
0 0 0 0 0 0 0 0 1 0

0 5 0 0 0 0 0 0 0 0
5 0 6 0 0 0 0 0 0 0
0 6 0 0 0 0 0 0 0 0
0 0 0 0 3 0 0 0 0 0
0 0 0 3 0 0 0 0 0 0
0 0 0 0 0 0 2 0 0 0
0 0 0 0 0 2 0 0 0 0
0 0 0 0 0 0 0 0 4 0
0 0 0 0 0 0 0 4 0 8
0 0 0 0 0 0 0 0 8 0

0 1 0 0 0 0 0 0
1 0 1 0 0 0 0 0
0 1 0 1 0 0 0 1
0 0 1 0 0 0 0 0
0 0 0 0 0 1 0 0
0 0 0 0 1 0 0 0
0 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0
 */